Autodesk.Revit.DB.Segment.AddSize(Autodesk.Revit.DB.MEPSize)
Adds a new MEPSize to the segment.
size:
The new MEPSize to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is already a same size in the settings.
-or-
The size already exists in the segment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.Segment.Description
The description of the segment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013